nguyentri/da-pac/svd/DA14585.svd
        <register>
          <name>BLE_INTCNTL_REG</name>
          <description>Interrupt controller register</description>
          <addressOffset>0x0000000c</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00ff801f</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>INTCSCNTL</name>
              <description>Selection of the CS counter that generates an interrupt. For example, if INTCNTL[3] is set, an interrupt is sent each time CS counter equals 3. </description>
              <bitRange>[31:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCNTDEVMSK</name>
              <description>CSCNT interrupt mask during event. This bit allows to enable CSCNT interrupt generation during events (i.e advertising, scanning, initiating, and connection)
0: CSCNT Interrupt not generated during events.
1: CSCNT Interrupt generated during events. </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIOCNTLINTMSK</name>
              <description>Radio Controller interrupt mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FINETGTIMINTMSK</name>
              <description>Fine Target Timer Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GROSSTGTIMINTMSK</name>
              <description>Gross Target Timer Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>ERRORINTMSK</name>
              <description>Error Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CRYPTINTMSK</name>
              <description>Encryption / Decryption Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EVENTINTMSK</name>
              <description>End of event Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SLPINTMSK</name>
              <description>Sleep Mode Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXINTMSK</name>
              <description>Rx Interrupt Mask
0: Interrupt not generated
1: Interrupt generated </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CSCNTINTMSK</name>
              <description>625usec Base Time Interrupt Mask\n 0: Interrupt not generated\n 1: Interrupt generated </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_INTRAWSTAT_REG</name>
          <description>Interrupt raw status register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>RADIOCNTLINTRAWSTAT</name>
              <description>Radio Controller interrupt raw status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FINETGTIMINTRAWSTAT</name>
              <description>Fine Target Timer Error interrupt raw status
0: No Fine Target Timer interrupt.
1: A Fine Target Timer interrupt is pending. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GROSSTGTIMINTRAWSTAT</name>
              <description>Gross Target Timer interrupt raw status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRORINTRAWSTAT</name>
              <description>Error interrupt raw status
0: No Error interrupt.
1: An Error interrupt is pending. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRYPTINTRAWSTAT</name>
              <description>Encryption/Decryption interrupt raw status
0: No Encryption / Decryption interrupt.
1: An Encryption / Decryption interrupt is pending. </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENTINTRAWSTAT</name>
              <description>End of Event interrupt raw status
0: No End of Advertising / Scanning / Connection interrupt.
1: An End of Advertising / Scanning / Connection interrupt is pending. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLPINTRAWSTAT</name>
              <description>Sleep interrupt raw status
0: No End of Sleep Mode interrupt.
1: An End of Sleep Mode interrupt is pending. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXINTRAWSTAT</name>
              <description>Packet Reception interrupt raw status
0: No Rx interrupt.
1: An Rx interrupt is pending. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSCNTINTRAWSTAT</name>
              <description>625us base time reference interrupt raw status
0: No 625us Base Time interrupt.
1: A 625us Base Time interrupt is pending. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_INTSTAT_REG</name>
          <description>Interrupt status register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>RADIOCNTLINTSTAT</name>
              <description>Radio Controller interrupt status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
              <bitRange>[8:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>FINETGTIMINTSTAT</name>
              <description>Masked Fine Target Timer Error interrupt status
0: No Fine Target Timer interrupt.
1: A Fine Target Timer interrupt is pending. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GROSSTGTIMINTSTAT</name>
              <description>Masked Gross Target Timer interrupt status
0: No Gross Target Timer interrupt.
1: A Gross Target Timer interrupt is pending. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>ERRORINTSTAT</name>
              <description>Masked Error interrupt status
0: No Error interrupt.
1: An Error interrupt is pending. </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CRYPTINTSTAT</name>
              <description>Masked Encryption/Decryption interrupt status
0: No Encryption / Decryption interrupt.
1: An Encryption / Decryption interrupt is pending. </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>EVENTINTSTAT</name>
              <description>Masked End of Event interrupt status
0: No End of Advertising / Scanning / Connection interrupt.
1: An End of Advertising / Scanning / Connection interrupt is pending. </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>SLPINTSTAT</name>
              <description>Masked Sleep interrupt status
0: No End of Sleep Mode interrupt.
1: An End of Sleep Mode interrupt is pending. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RXINTSTAT</name>
              <description>Masked Packet Reception interrupt status
0: No Rx interrupt.
1: An Rx interrupt is pending. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>CSCNTINTSTAT</name>
              <description>Masked 625us base time reference interrupt status
0: No 625us Base Time interrupt.
1: A 625us Base Time interrupt is pending. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RADIOCNTL0_REG</name>
          <description>Radio interface control register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00002102</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>DPCORR_EN</name>
              <description>Enable the use of delayed DC compensated data path in Radio Correlator block
1: Enable
0: Disable
Must be set to '0'. </description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RADIOCNTL1_REG</name>
          <description>Radio interface control register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>XRFSEL</name>
              <description>Extended radio selection field, Must be set to '00011'. </description>
              <bitRange>[20:16]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RADIOPWRUPDN_REG</name>
          <description>RX/TX power up/down phase register</description>
          <addressOffset>0x00000080</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00d203d2</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>RTRIP_DELAY</name>
              <description>Defines round trip delay value. This value correspond to the addition of data latency in Tx and data latency in Rx. Value is in us. </description>
              <bitRange>[30:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RXPWRUP</name>
              <description>This register holds the length in us of the Rx power up phase for the current radio device. Default value is 210 us (reset value). Operating range depends of the selected radio. </description>
              <bitRange>[23:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPWRDN</name>
              <description>This register extends the length in us of the Tx power down phase for the current radio device. Default value is 3us (reset value). Operating range depends of the selected radio. </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPWRUP</name>
              <description>This register holds the length in us of the Tx power up phase for the current radio device. Default value is 210 us (reset value). Operating range depends of the selected radio. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RFTESTCNTL_REG</name>
          <description>RF Testing Register</description>
          <addressOffset>0x000000e0</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>INFINITERX</name>
              <description>Applicable for all frame format
0: Normal mode of operation
1: Infinite Rx window </description>
              <bitRange>[31:31]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INFINITETX</name>
              <description>Applicable for all frame format
0: Normal mode of operation.
1: Infinite Tx packet / Normal start of a packet but endless payload
In case of infinite Tx payload, and when PRBS source is not selected, then RFTESTCNTL-TXLENGTH field provides the length of the pattern to repeat in the payload. </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLENGTHSRC</name>
              <description>Applicable only in Tx/Rx RF Test mode
0: Normal mode of operation: TXDESC-TXADVLEN controls the Tx packet payload size
1: Uses RFTESTCNTL-TXLENGTH packet length (can support up to 512 bytes transmit) </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PRBSTYPE</name>
              <description>Applicable only in Tx/Rx RF Test mode
0: Tx Packet Payload are PRBS9 type
1: Tx Packet Payload are PRBS15 type
PRBS9 is defined as p(x)=1+x5+x9. The LFSR used for the PRBS9 generator must be initialized with 0x1FF value.
PRBS15 is defined as p(x)=1+x+x2+x12+x13+x14. The LFSR used for the PRBS15 generator must be initialized with 0x7FFF value. </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXPLDSRC</name>
              <description>Applicable only in Tx/Rx RF Test mode
0: Tx Packet Payload source is the Control Structure
1: Tx Packet Payload are PRBS generator </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXLENGTH</name>
              <description>Applicable only in Tx/Rx RF Test mode
Tx packet length in number of byte </description>
              <bitRange>[8:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BLE_RF_DIAGIRQ_REG</name>
          <description>BLE/RF Diagnostic IRQ Control Register</description>
          <addressOffset>0x00000204</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x7fffffff</resetMask>
          <fields>
            <field>
              <name>DIAGIRQ_STAT_3</name>
              <description>Same as DIAGIRQ_STAT_0.</description>
              <bitRange>[31:31]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIAGIRQ_EDGE_3</name>
              <description>Same as DIAGIRQ_EDGE_0.</description>
              <bitRange>[30:30]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_BSEL_3</name>
              <description>Same as DIAGIRQ_BSEL_0.</description>
              <bitRange>[29:27]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_WSEL_3</name>
              <description>Same as DIAGIRQ_WSEL_0.</description>
              <bitRange>[26:25]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_MASK_3</name>
              <description>Same as DIAGIRQ_MASK_0.</description>
              <bitRange>[24:24]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_STAT_2</name>
              <description>Same as DIAGIRQ_STAT_0.</description>
              <bitRange>[23:23]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIAGIRQ_EDGE_2</name>
              <description>Same as DIAGIRQ_EDGE_0.</description>
              <bitRange>[22:22]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_BSEL_2</name>
              <description>Same as DIAGIRQ_BSEL_0.</description>
              <bitRange>[21:19]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_WSEL_2</name>
              <description>Same as DIAGIRQ_WSEL_0.</description>
              <bitRange>[18:17]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_MASK_2</name>
              <description>Same as DIAGIRQ_MASK_0.</description>
              <bitRange>[16:16]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_STAT_1</name>
              <description>Same as DIAGIRQ_STAT_0.</description>
              <bitRange>[15:15]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIAGIRQ_EDGE_1</name>
              <description>Same as DIAGIRQ_EDGE_0.</description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_BSEL_1</name>
              <description>Same as DIAGIRQ_BSEL_0.</description>
              <bitRange>[13:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_WSEL_1</name>
              <description>Same as DIAGIRQ_WSEL_0.</description>
              <bitRange>[10:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_MASK_1</name>
              <description>Same as DIAGIRQ_MASK_0.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_STAT_0</name>
              <description>Diagnostic IRQ Status 0
This bit is read only. It is automatically cleared to '0' on each read of the BLE_RF_DIAGIRQ_REG register. It is automatically asserted to '1' on each detection of the selected edge, of the selected bit, of the selected word.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DIAGIRQ_EDGE_0</name>
              <description>Diagnostic IRQ Edge 0
Selects the edge of the selected bit (refer to DIAGIRQ_BSEL_0) that will trigger the assertion of DIAGIRQ_STAT_0.
If '0' then the positive edge is selected, when '1' the negative edge is selected.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_BSEL_0</name>
              <description>Diagnostic IRQ Bit Select 0
Selects the bit of the 8-bit bus (as selected by the DIAGIRQ_WSEL_0) that will be used for the IRQ generation.</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_WSEL_0</name>
              <description>Diagnostic IRQ Word Select 0
Selects the 8-bit diagnostic bus that will be used for the IRQ generation.
00: Selects the BLE_DIAG0
01: Selects the BLE_DIAG1
10: Selects the RADIO_DIAG0
11: Selects the RADIO_DIAG1</description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DIAGIRQ_MASK_0</name>
              <description>Diagnostic IRQ Mask 0
When set to '1' a BLE_RF_DIAG_IRQ will be generated on each rise of the DIAGIRQ_STAT_0 bit.
When cleared to '0' no IRQ will be generated.</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
