nguyentri/da-pac/svd/DA14585.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CHIP_VERSION</name>
      <version>1.0</version>
      <description>CHIP_VERSION registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50003200</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>12</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CHIP_CONFIG1_REG</name>
          <description>Chip configuration register 1.</description>
          <addressOffset>0x00000005</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_CONFIG1</name>
              <description>First character of Chip Configuration '0M2' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_CONFIG2_REG</name>
          <description>Chip configuration register 2.</description>
          <addressOffset>0x00000006</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x0000004d</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_CONFIG2</name>
              <description>Second character of Chip Configuration '0M2' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_CONFIG3_REG</name>
          <description>Chip configuration register 3.</description>
          <addressOffset>0x00000007</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000032</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_CONFIG3</name>
              <description>Third character of Chip Configuration '0M2' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_ID1_REG</name>
          <description>Chip identification register 1.</description>
          <addressOffset>0x00000000</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000035</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID1</name>
              <description>First character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_ID2_REG</name>
          <description>Chip identification register 2.</description>
          <addressOffset>0x00000001</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000038</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID2</name>
              <description>Second character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_ID3_REG</name>
          <description>Chip identification register 3.</description>
          <addressOffset>0x00000002</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000030</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_ID3</name>
              <description>Third character of device type '580' in ASCII. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_REVISION_REG</name>
          <description>Chip revision register.</description>
          <addressOffset>0x00000004</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000041</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>REVISION_ID</name>
              <description>Chip version, corresponds with type number in ASCII.
0x41 = 'A', 0x42 = 'B' </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_SWC_REG</name>
          <description>Software compatibility register.</description>
          <addressOffset>0x00000003</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>CHIP_SWC</name>
              <description>SoftWare Compatibility code.
Integer (default = 0) which is incremented if a silicon change has impact on the CPU Firmware.
Can be used by software developers to write silicon revision dependent code. </description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CHIP_TEST1_REG</name>
          <description>Chip test register 1.</description>
          <addressOffset>0x0000000a</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
        </register>
        <register>
          <name>CHIP_TEST2_REG</name>
          <description>Chip test register 2.</description>
          <addressOffset>0x0000000b</addressOffset>
          <size>8</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000000ff</resetMask>
        </register>
