nguyentri/da-pac/svd/DA14585.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>crg580_nl01</name>
      <version>1.0</version>
      <description>crg580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50000000</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>64</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>ANA_STATUS_REG</name>
          <description>Status bit of analog (power management) circuits</description>
          <addressOffset>0x0000002a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000090</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>BOOST_SELECTED</name>
              <description>Indicates that DCDC is in boost mode </description>
              <bitRange>[9:9]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BANDGAP_OK</name>
              <description>Indicates that BANDGAP is OK </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>BOOST_VBAT_OK</name>
              <description>Indicates that VBAT is above threshold while in BOOST converter mode. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_ANA_OK</name>
              <description>Indicates that LDO_ANA is in regulation. This LDO is used for the general-purpose ADC only </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_VDD_OK</name>
              <description>Indicates that LDO_VDD is in regulation </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LDO_OTP_OK</name>
              <description>Indicates that LDO_OTP is in regulation </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VDCDC_OK</name>
              <description>Indicates that VDCDC is above threshold. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VBAT1V_OK</name>
              <description>Indicates that VBAT1V is above threshold. </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>VBAT1V_AVAILABLE</name>
              <description>Indicates that VBAT1V is available. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BANDGAP_REG</name>
          <description>Bandgap trimming</description>
          <addressOffset>0x00000028</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>BGR_LOWPOWER</name>
              <description>Test-mode, do not use.
It disables the bandgap core (voltages will continue for some time, but will slowely drift away) </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LDO_RET_TRIM</name>
              <bitRange>[13:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_ITRIM</name>
              <description>Current trimming for bias </description>
              <bitRange>[9:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BGR_TRIM</name>
              <description>Trim register for bandgap </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_16M_REG</name>
          <description>16 MHz RC-oscillator register</description>
          <addressOffset>0x00000022</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000000a0</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL16_NOISE_FILT_ENABLE</name>
              <description>Enables noise flter in 16 MHz crystal oscillator </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL16_BIAS_SH_ENABLE</name>
              <description>Enables Ibias sample/hold function in 16 MHz crystal oscillator. This bit should be set when the system wake up and reset before entering deep or extended sleep mode.</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL16_CUR_SET</name>
              <description>Bias current for the 16 MHz XTAL oscillator.
0x0: minimum
0x7: maximum</description>
              <bitRange>[7:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC16M_TRIM</name>
              <description>Controls the frequency of the RC16M oscillator.
0x0: lowest frequency
0xF: highest frequency </description>
              <bitRange>[4:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC16M_ENABLE</name>
              <description>Enables the 16 MHz RC oscillator </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_32K_REG</name>
          <description>32 kHz oscillator register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000079c</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL32K_DISABLE_AMPREG</name>
              <description>Setting this bit disables the amplitude regulation of the XTAL32kHz oscillator.
Set this bit to '1' for an external clock applied at XTAL32Kp.
Keep this bit '0' with a crystal between XTAL32Kp and XTAL32Km.</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32K_TRIM</name>
              <description>Controls the frequency of the RC32K oscillator.
0x0: lowest frequency
0x7: default
0xF: highest frequency </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RC32K_ENABLE</name>
              <description>Enables the 32 kHz RC oscillator </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL32K_CUR</name>
              <description>Bias current for the 32kHz XTAL oscillator.
0x0: minimum
0x3: default
0xF: maximum
For each application there is an optimal setting for which the startup behaviour is optimal.</description>
              <bitRange>[6:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL32K_RBIAS</name>
              <description>Setting for the bias resistor of the 32 kHz XTAL oscillator.
0x0: maximum
0x3: minimum
Prefered setting will be provided by Dialog. </description>
              <bitRange>[2:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL32K_ENABLE</name>
              <description>Enables the 32 kHz XTAL oscillator </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_AMBA_REG</name>
          <description>HCLK, PCLK, divider and clock gates</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000022</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>OTP_ENABLE</name>
              <description>Clock enable for OTP controller </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PCLK_DIV</name>
              <description>APB interface clock (PCLK). Divider is cascaded with HCLK_DIV. PCLK is HCLK divided by:
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8 </description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>HCLK_DIV</name>
              <description>AHB interface and microprocessor clock (HCLK). HCLK is source clock divided by:
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8 </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_CTRL_REG</name>
          <description>Clock control register</description>
          <addressOffset>0x0000000a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000080</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RUNNING_AT_XTAL16M</name>
              <description>Indicates that the XTAL16M clock is used as clock, and may not be switched off </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING_AT_RC16M</name>
              <description>Indicates that the RC16M clock is used as clock </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RUNNING_AT_32K</name>
              <description>Indicates that either the RC32k or XTAL32k is being used as clock </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL16M_SPIKE_FLT_DISABLE</name>
              <description>Disable spikefilter in digital clock</description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>XTAL16M_DISABLE</name>
              <description>Setting this bit instantaneously disables the 16 MHz crystal oscillator. Also, after sleep/wakeup cycle, the oscillator will not be enabled. This bit may not be set to '1'when 'RUNNING_AT_XTAL16M is '1' to prevent deadlock. After resetting this bit, wait for XTAL16_SETTLED or XTAL16_TRIM_READY to become '1' before switching to XTAL16 clock source. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SYS_CLK_SEL</name>
              <description>Selects the clock source.
0x0: XTAL16M (check the XTAL16_SETTLED and XTAL16_TRIM_READY bits!!)
0x1: RC16M
0x2/0x3: either RC32k or XTAL32k is used </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_FREQ_TRIM_REG</name>
          <description>Xtal frequency trimming register</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>COARSE_ADJ</name>
              <description>Xtal frequency course trimming register.
0x0: lowest frequency
0x7: highest frequencyIncrement or decrement the binary value with 1. Wait approximately 200 us to allow the adjustment to settle. </description>
              <bitRange>[10:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FINE_ADJ</name>
              <description>Xtal frequency fine trimming register.
0x00: lowest frequency
0xFF: highest frequency </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_PER_REG</name>
          <description>Peripheral divider register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>QUAD_ENABLE</name>
              <description>Enable the Quadrature clock </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_ENABLE</name>
              <description>Enable SPI clock </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPI_DIV</name>
              <description>Division factor for SPI
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8 </description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART1_ENABLE</name>
              <description>Enable UART1 clock </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>UART2_ENABLE</name>
              <description>Enable UART2 clock </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>I2C_ENABLE</name>
              <description>Enable I2C clock </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WAKEUPCT_ENABLE</name>
              <description>Enable Wakeup CaptureTimer clock </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR_ENABLE</name>
              <description>Enable TIMER0 and TIMER2 clock </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TMR_DIV</name>
              <description>Division factor for TIMER0 and TIMER2
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8 </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RADIO_REG</name>
          <description>Radio PLL control register</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>BLE_ENABLE</name>
              <description>Enable the BLE core clocks </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_LP_RESET</name>
              <description>Reset for the BLE LP timer </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>BLE_DIV</name>
              <description>Division factor for BLE core blocks
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8
The programmed frequency should not be lower than 8 MHz and not faster than the programmed CPU clock frequency. Refer also to BLE_CNTL2_REG[BLE_CLK_SEL].</description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCU_ENABLE</name>
              <description>Enable the RF control Unit clock </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RFCU_DIV</name>
              <description>Division factor for RF Control Unit
0x0: divide by 1
0x1: divide by 2
0x2: divide by 4
0x3: divide by 8
The programmed frequency must be exactly 8 MHz. </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLK_RCX20K_REG</name>
          <description>RCX-oscillator control register</description>
          <addressOffset>0x00000024</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000178</resetValue>
          <resetMask>0x00001fff</resetMask>
          <fields>
            <field>
              <name>RCX20K_SELECT</name>
              <description>Selects RCX oscillator.
0 : RC32K oscillator
1: RCX oscillator</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCX20K_ENABLE</name>
              <description>Enable the RCX oscillator</description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCX20K_LOWF</name>
              <description>Extra low frequency</description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCX20K_BIAS</name>
              <description>Bias control</description>
              <bitRange>[9:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCX20K_NTC</name>
              <description>Temperature control</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RCX20K_TRIM</name>
              <description>Controls the frequency of the RCX oscillator.
0x0: lowest frequency
0x7: default
0xF: highest frequency</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMU_CTRL_REG</name>
          <description>Power Management Unit control register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000006</resetValue>
          <resetMask>0x0000fff7</resetMask>
          <fields>
            <field>
              <name>RETENTION_MODE</name>
              <description>Select the retainability of the 4 retention RAM macros.
'1' is retainable, '0' is power gated.
(3) is RETRAM4
(2) is RETRAM3
(1) is RETRAM2
(0) is RETRAM1</description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_BOOST</name>
              <description>Force the DCDC into boost mode at next wakeup.
Setting this bit reduces the deepsleep current.
FORCE_BOOST has highest priority.
When either FORCE_BOOST or FORCE_BUCK have been written, these bits cannot be changed.</description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCE_BUCK</name>
              <description>Force the DCDC into buck mode at next wakeup.
Setting this bit reduces the deepsleep current.
FORCE_BOOST has highest priority.
When either FORCE_BOOST or FORCE_BUCK have been written, these bits cannot be changed.</description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_COPY_DIV</name>
              <description>Sets the HCLK division during OTP mirroring </description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RADIO_SLEEP</name>
              <description>Put the digital part of the radio in powerdown </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PERIPH_SLEEP</name>
              <description>Put all peripherals (I2C, UART, SPI, ADC) in powerdown </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RESET_ON_WAKEUP</name>
              <description>Perform a Hardware Reset after waking up. Booter will be started. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_IO_CTRL1_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x00000030</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000000f</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RFIO_TRIM1_CAP</name>
              <description>Trim the RFIO input capacitance
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
