nguyentri/da-pac/svd/DA14585.svd
        <register>
          <name>RF_LNA_CTRL1_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x00000032</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000024e</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_TRIM_CD_HF</name>
              <description>Trim the LNA output capacitance for CN &gt; 19
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_TRIM_CD_LF</name>
              <description>Trim the LNA output capacitance for CN 00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_LNA_CTRL2_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x00000034</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000226</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_TRIM_GM_LO</name>
              <description>Trim the LNA bias resistor for optimum transcunductance (gain) in AGC settings 2 and 3
00: Minimum transconductance
10: Nominal transconductance
1F: Maximal transconductance </description>
              <bitRange>[11:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LNA_TRIM_GM_HI</name>
              <description>Trim the LNA bias resistor for optimum transcunductance (gain) in AGC settings 0 and 1
00: Minimum transconductance
10: Nominal transconductance
1F: Maximal transconductance </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_LNA_CTRL3_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x00000036</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000007</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LNA_TRIM_CGS</name>
              <description>Trim the LNA gate-source capacitance
00: Minimum capacitance
10: Nominal capacitance
1F: Maximal capacitance </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RSSI_COMP_CTRL_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x00000038</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00008777</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RSSI_COMP00</name>
              <description>RSSI compensation value for LNA gain setting 00
'0x0': -8
'0x1': -7
'0x2': -6
'0x3': -5
'0x4': -4
'0x5': -3
'0x6': -2
'0x7': -1
'0x8': 0 (reset)
'0x9': 1
'0xA': 2
'0xB': 3
'0xC': 4
'0xD': 5
'0xE': 6
'0xF': 7 </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_COMP11</name>
              <description>RSSI compensation value for LNA gain setting 11 relative to 00
Coding identical to RSSI_COMP01. </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_COMP10</name>
              <description>RSSI compensation value for LNA gain setting 10 relative to 00
Coding identical to RSSI_COMP01. </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RSSI_COMP01</name>
              <description>RSSI compensation value for LNA gain setting 01 relative to 00
'0x0': -4
'0x1': -3
'0x2': -2
'0x3': -1
'0x4': 0
'0x5': 1
'0x6': 2
'0x7': 3 (reset)
'0x8': 4
'0x9': 5
'0xA': 6
'0xB': 7
'0xC': 8
'0xD': 9
'0xE': 10
'0xF': 11 </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_VCO_CTRL_REG</name>
          <addressOffset>0x0000003a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000001</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_AMPL_SET</name>
              <description>Set the desired amplitude of the VCO'0': minimum amplitude
'4': default amplitude
'F': maximum amplitude </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SPOTP_TEST_REG</name>
          <description>(in CRG)</description>
          <addressOffset>0x0000003e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LDO_OTP_WRITE</name>
              <description>Bypass LDO and put VBAT directly on OTP_VDDIO </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SPOTP_ACTIVE</name>
              <description>Enables the SPOTP testmode. Reset by write or PowerOnReset </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_CTRL_REG</name>
          <description>System Control register</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000020</resetValue>
          <resetMask>0x000083ff</resetMask>
          <fields>
            <field>
              <name>SW_RESET</name>
              <description>Writing a '1' to this bit will reset the device, except for:
SYS_CTRL_REG
CLK_FREQ_TRIM_REG
... </description>
              <bitRange>[15:15]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>TIMEOUT_DISABLE</name>
              <description>Disables timeout in Power statemachine. By default, the statemachine continues if after 2 ms the blocks are not started up. This can be read back from
ANA_STATUS_REG. </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEBUGGER_ENABLE</name>
              <description>Enable the debugger. This bit is set by the booter according to the OTP header. If not set, the SWDIO and SW_CLK can be used as gpio ports. </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTPC_RESET_REQ</name>
              <description>Reset request for the OTP controller. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PAD_LATCH_EN</name>
              <description>Latches the control signals of the pads for state retention in powerdown mode.
0: Control signals are retained
1: Latch is transparant, pad can be recontrolled </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>OTP_COPY</name>
              <description>Enables OTP to SysRAM copy action after waking up PD_SYS </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CLK32_SOURCE</name>
              <description>Sets the clock source of the 32 kHz clock
0 = RC-oscillator
1 = 32 kHz crystal oscillator </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RET_SYSRAM</name>
              <description>Sets the development phase mode.
If this bit is set, the SysRAM cell will not power gated during sleep (extended sleep).
No copy action to SysRAM is done when the system wakes up.
For emulating startup time, the OTP_COPY bit still needs to be set. </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REMAP_ADR0</name>
              <description>Controls which memory is located at address 0x0000 for execution.
0x0: ROM
0x1: OTP
0x2: SysRAM
0x3: RetRAM</description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SYS_STAT_REG</name>
          <description>System status register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000055</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>XTAL16_SETTLED</name>
              <description>Indicates that XTAL16 has had &gt; 2 ms of settle time </description>
              <bitRange>[7:7]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>XTAL16_TRIM_READY</name>
              <description>Indicates that XTAL trimming mechanism is ready, i.e. the trimming equals CLK_FREQ_TRIM_REG. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_IS_UP</name>
              <description>Indicates that PD_DBG is functional </description>
              <bitRange>[5:5]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>DBG_IS_DOWN</name>
              <description>Indicates that PD_DBG is in power down </description>
              <bitRange>[4:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_IS_UP</name>
              <description>Indicates that PD_PER is functional </description>
              <bitRange>[3:3]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>PER_IS_DOWN</name>
              <description>Indicates that PD_PER is in power down </description>
              <bitRange>[2:2]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RAD_IS_UP</name>
              <description>Indicates that PD_RAD is functional </description>
              <bitRange>[1:1]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RAD_IS_DOWN</name>
              <description>Indicates that PD_RAD is in power down </description>
              <bitRange>[0:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TRIM_CTRL_REG</name>
          <description>Control trimming of the XTAL16M</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x000000a2</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>TRIM_TIME</name>
              <description>Defines the delay between XTAL16M enable and applying the CLK_FREQ_TRIM_REG in steps of 250 us.
0x0: apply directly
0x1: wait between 0 and 250 us
0x2: wait between 250 us and 500 us
etc.</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SETTLE_TIME</name>
              <description>Defines the delay between applying CLK_FREQ_TRIM_REG and XTAL16_SETTLED in steps of 250 us.
0x0: XTAL16_SETTLED is set direcly
0x1: wait between 0 and 250 us
0x2: wait between 250 us and 500 us
etc.</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
