nguyentri/da-pac/svd/DA14585.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>kbrd580_nl01</name>
      <version>1.0</version>
      <description>kbrd580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50001400</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>24</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>GPIO_DEBOUNCE_REG</name>
          <description>debounce counter value for GPIO inputs</description>
          <addressOffset>0x0000000c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>DEB_ENABLE_KBRD</name>
              <description>enables the debounce counter for the KBRD interface </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_ENABLE4</name>
              <description>enables the debounce counter for GPIO IRQ4 </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_ENABLE3</name>
              <description>enables the debounce counter for GPIO IRQ3 </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_ENABLE2</name>
              <description>enables the debounce counter for GPIO IRQ2 </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_ENABLE1</name>
              <description>enables the debounce counter for GPIO IRQ1 </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_ENABLE0</name>
              <description>enables the debounce counter for GPIO IRQ0 </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DEB_VALUE</name>
              <description>Keyboard debounce time if enabled. Generate KEYB_INT after specified time.
Debounce time: N*1 ms. N =0..63</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_INT_LEVEL_CTRL_REG</name>
          <description>high or low level select for GPIO interrupts</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000dfdf</resetMask>
          <fields>
            <field>
              <name>EDGE_LEVELn4</name>
              <description>see EDGE_LEVELn0, but for GPIO IRQ4 </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_LEVELn3</name>
              <description>see EDGE_LEVELn0, but for GPIO IRQ3 </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_LEVELn2</name>
              <description>see EDGE_LEVELn0, but for GPIO IRQ2 </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_LEVELn1</name>
              <description>see EDGE_LEVELn0, but for GPIO IRQ1 </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EDGE_LEVELn0</name>
              <description>0: do not wait for key release after interrupt was reset for GPIO IRQ0, so a new interrupt can be initiated immediately
1: wait for key release after interrupt was reset for IRQ0 </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LEVEL4</name>
              <description>see INPUT_LEVEL0, but for GPIO IRQ4 </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LEVEL3</name>
              <description>see INPUT_LEVEL0, but for GPIO IRQ3 </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LEVEL2</name>
              <description>see INPUT_LEVEL0, but for GPIO IRQ2 </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LEVEL1</name>
              <description>see INPUT_LEVEL0, but for GPIO IRQ1 </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>INPUT_LEVEL0</name>
              <description>0 = selected input will generate GPIO IRQ0 if that input is high.
1 = selected input will generate GPIO IRQ0 if that input is low. </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_IRQ0_IN_SEL_REG</name>
          <description>GPIO interrupt selection for GPIO_IRQ0</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_IRQ0_SEL</name>
              <description>input selection that can generate a GPIO interrupt
0: no input selected
1: P0[0] is selected
2: P0[1] is selected
3: P0[2] is selected
4: P0[3] is selected
5: P0[4] is selected
6: P0[5] is selected
7: P0[6] is selected
8: P0[7] is selected
9: P1[0] is selected
10: P1[1] is selected
11: P1[2] is selected
12: P1[3] is selected
13: P1[4] is selected
14: P1[5] is selected
15: P2[0] is selected
16: P2[1] is selected
17: P2[2] is selected
18: P2[3] is selected
19: P2[4] is selected
20: P2[5] is selected
21: P2[6] is selected
22: P2[7] is selected
23: P2[8] is selected
24: P2[9] is selected
25: P3[0] is selected
26: P3[1] is selected
27: P3[2] is selected
28: P3[3] is selected
29: P3[4] is selected
30: P3[5] is selected
31: P3[6] is selected
32: P3[7] is selected
all others: no input selected </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_IRQ1_IN_SEL_REG</name>
          <description>GPIO interrupt selection for GPIO_IRQ1</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_IRQ1_SEL</name>
              <description>see KBRD_IRQ0_SEL </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_IRQ2_IN_SEL_REG</name>
          <description>GPIO interrupt selection for GPIO_IRQ2</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_IRQ2_SEL</name>
              <description>see KBRD_IRQ0_SEL </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_IRQ3_IN_SEL_REG</name>
          <description>GPIO interrupt selection for GPIO_IRQ3</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_IRQ3_SEL</name>
              <description>see KBRD_IRQ0_SEL </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_IRQ4_IN_SEL_REG</name>
          <description>GPIO interrupt selection for GPIO_IRQ4</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_IRQ4_SEL</name>
              <description>see KBRD_IRQ0_SEL </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>GPIO_RESET_IRQ_REG</name>
          <description>GPIO interrupt reset register</description>
          <addressOffset>0x0000000e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RESET_KBRD_IRQ</name>
              <description>writing a 1 to this bit will reset the KBRD IRQ.
Reading returns 0. </description>
              <bitRange>[5:5]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET_GPIO4_IRQ</name>
              <description>writing a 1 to this bit will reset the GPIO4 IRQ.
Reading returns 0. </description>
              <bitRange>[4:4]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET_GPIO3_IRQ</name>
              <description>writing a 1 to this bit will reset the GPIO3 IRQ.
Reading returns 0. </description>
              <bitRange>[3:3]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET_GPIO2_IRQ</name>
              <description>writing a 1 to this bit will reset the GPIO2 IRQ.
Reading returns 0. </description>
              <bitRange>[2:2]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET_GPIO1_IRQ</name>
              <description>writing a 1 to this bit will reset the GPIO1 IRQ.
Reading returns 0. </description>
              <bitRange>[1:1]</bitRange>
              <access>write-only</access>
            </field>
            <field>
              <name>RESET_GPIO0_IRQ</name>
              <description>writing a 1 to this bit will reset the GPIO0 IRQ.
Reading returns 0. </description>
              <bitRange>[0:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KBRD_IRQ_IN_SEL0_REG</name>
          <description>GPIO interrupt selection for KBRD_IRQ for P0</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_REL</name>
              <description>0 = No interrupt on key release
1 = Interrupt also on key release (also debouncing if enabled) </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_LEVEL</name>
              <description>0 = enabled input will generate KBRD IRQ if that input is high.
1 = enabled input will generate KBRD IRQ if that input is low. </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KEY_REPEAT</name>
              <description>While key is pressed, automatically generate repeating
KEYB_INT after specified time unequal to 0.
Repeat time: N*1 ms. N =1..63, N=0 disables the timer. </description>
              <bitRange>[13:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P07_EN</name>
              <description>enable P0[7] for the keyboard interrupt </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P06_EN</name>
              <description>enable P0[6] for the keyboard interrupt </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P05_EN</name>
              <description>enable P0[5] for the keyboard interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P04_EN</name>
              <description>enable P0[4] for the keyboard interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P03_EN</name>
              <description>enable P0[3] for the keyboard interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P02_EN</name>
              <description>enable P0[2] for the keyboard interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P01_EN</name>
              <description>enable P0[1] for the keyboard interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P00_EN</name>
              <description>enable P0[0] for the keyboard interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KBRD_IRQ_IN_SEL1_REG</name>
          <description>GPIO interrupt selection for KBRD_IRQ for P1 and P2</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>KBRD_P15_EN</name>
              <description>enable P1[5] for the keyboard interrupt </description>
              <bitRange>[15:15]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P14_EN</name>
              <description>enable P1[4] for the keyboard interrupt </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P13_EN</name>
              <description>enable P1[3] for the keyboard interrupt </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P12_EN</name>
              <description>enable P1[2] for the keyboard interrupt </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P11_EN</name>
              <description>enable P1[1] for the keyboard interrupt </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P10_EN</name>
              <description>enable P1[0] for the keyboard interrupt </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P29_EN</name>
              <description>enable P2[9] for the keyboard interrupt </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P28_EN</name>
              <description>enable P2[8] for the keyboard interrupt </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P27_EN</name>
              <description>enable P2[7] for the keyboard interrupt </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P26_EN</name>
              <description>enable P2[6] for the keyboard interrupt </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P25_EN</name>
              <description>enable P2[5] for the keyboard interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P24_EN</name>
              <description>enable P2[4] for the keyboard interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P23_EN</name>
              <description>enable P2[3] for the keyboard interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P22_EN</name>
              <description>enable P2[2] for the keyboard interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P21_EN</name>
              <description>enable P2[1] for the keyboard interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P20_EN</name>
              <description>enable P2[0] for the keyboard interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KBRD_IRQ_IN_SEL2_REG</name>
          <description>GPIO interrupt selection for KBRD_IRQ for P3</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>KBRD_P37_EN</name>
              <description>enable P3[7] for the keyboard interrupt </description>
              <bitRange>[7:7]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P36_EN</name>
              <description>enable P3[6] for the keyboard interrupt </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P35_EN</name>
              <description>enable P3[5] for the keyboard interrupt </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P34_EN</name>
              <description>enable P3[4] for the keyboard interrupt </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P33_EN</name>
              <description>enable P3[3] for the keyboard interrupt </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P32_EN</name>
              <description>enable P3[2] for the keyboard interrupt </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P31_EN</name>
              <description>enable P3[1] for the keyboard interrupt </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>KBRD_P30_EN</name>
              <description>enable P3[0] for the keyboard interrupt </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
