nguyentri/da-pac/svd/DA14585.svd
same coding as for LF_RES_TX </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>LF_RES_SET_RX</name>
              <description>Loopfilter resistor setting during PLL settling in RX mode
same coding as for LF_RES_TX </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_MGAIN_CTRL2_REG</name>
          <addressOffset>0x00000c0a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000010</resetValue>
          <resetMask>0x0000007f</resetMask>
          <fields>
            <field>
              <name>MGAIN_TRANSMIT_LENGTH</name>
              <description>Number of symbols for transmit0 and transmit1 length during mgain calibration. </description>
              <bitRange>[6:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_MGAIN_CTRL_REG</name>
          <addressOffset>0x00000c08</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ff00</resetMask>
          <fields>
            <field>
              <name>KMOD_ALPHA</name>
              <description>Kmod channel dependent trimming constant.
0: No trimming is activated
&gt;0: The modulation gain in the direct path is modified with a factor: 1-SGNx(KMOD_ALPHA+2)x(CN-CN_CAL_RD)/2048</description>
              <bitRange>[15:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGAIN_AVER</name>
              <description>Average over a number of comparator output values
0: 1 value
1: 3 values
2: 5 values
3: 7 values </description>
              <bitRange>[12:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGAIN_CMP_INV</name>
              <description>Invert the output of the modulation gain comparator before usage. </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGAIN_DBL_TRANSMIT</name>
              <description>Length of a modulation gain calibration step
0: 4 symbol periods
1: 8 symbol periods </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAUSS_GAIN_SEL</name>
              <description>0: Normal operation
1: Use GAUSS_GAIN_WR for the modulation gain </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_MGC_CTRL_REG</name>
          <addressOffset>0x00000c10</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>GAUSS_DAC_CTRL</name>
              <description>Reserved bits for Gauss DAC settings </description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGC_POLE_SW</name>
              <description>Switch in an aditional pole on the mgc amplifer to have extra filtering of the loopfilter voltage.
'0': no pole (bandwidth limited by the opamp)
'1': switch in pole to reduce amplifier bandwidth</description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MGC_GAIN_SET</name>
              <description>Set the desired gain for the mgc calibration amplifier.
'0': gain= 15x
'1': gain= 10x </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_MIXER_CTRL1_REG</name>
          <addressOffset>0x00000810</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000035</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>MIX_SPARE</name>
              <description>Spare registers for mixer control </description>
              <bitRange>[15:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_TRIM_VCM</name>
              <description>Trim the common mode voltage at the input of the TIA
0: Minimum voltage
8: Nominal voltage
F: Maximal voltage </description>
              <bitRange>[11:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_TRIM_IBIAS</name>
              <description>Trim the bias current of the TIA
0: Minimum bias current
8: Nominal bias current
F: Maximal bias current </description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_TRIM_GMBIAS</name>
              <description>Trim the Mixer bias resistor for optimum transcunductance
0: Minimum transconductance
8: Nominal transconductance
F: Maximal transconductance </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_MIXER_CTRL2_REG</name>
          <addressOffset>0x00000812</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000000c</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>MIX_CAL_CAP_SEL</name>
              <description>'0': Normal operation: use IF_CAL_CAP_RD (as determined by IF calibration) for the loop filter capacitance;
'1': use the value written to MIX_CAL_CAP_WR </description>
              <bitRange>[5:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MIX_CAL_CAP_WR</name>
              <description>External value for calibration of mixer pole capacitance </description>
              <bitRange>[4:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_OVERRULE_REG</name>
          <addressOffset>0x00000020</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RX_EN_WR</name>
              <description>Enable rx_en </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>RX_DIS_WR</name>
              <description>Disable rx_en </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_EN_WR</name>
              <description>Enable tx_en </description>
              <bitRange>[1:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TX_DIS_WR</name>
              <description>Disable tx_en </description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_PA_CTRL_REG</name>
          <description>Removed obsolete values of bits 10:7, pa_pw back to 4</description>
          <addressOffset>0x00000a00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00007cd7</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>LEVEL_LDO_RFPA</name>
              <description>Control for PA supply voltage (output power) </description>
              <bitRange>[14:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_RAMPSPEED</name>
              <description>Ramping speed setting of the driver stage:
'0x0': slowest (1.25 uA)
'0x1': 2x faster (2.5 uA)
'0x2': default ramping speed
'0x3': fastest </description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_PW</name>
              <description>Pulse width setting to control HD2
'0': not active
'1': 48.8 percent duty cycle
'2': 49.4 percent duty cycle
'3': 49.7 percent duty cycle
'4': 50   percent duty cycle (default)
'5': 50.3 percent duty cycle
'6': 50.6 percent duty cycle
'7': 51.2 percent duty cycle </description>
              <bitRange>[4:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>PA_GAIN</name>
              <description>Sets gain/DC Current setting of the differential to single ended converter
'0': smallest current setting (60 uA)
'1': current setting 1 (80 uA)
'2': default (100 uA)
'3': largest current setting (120 uA) </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_PFD_CTRL_REG</name>
          <addressOffset>0x00000c40</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PFD_POLARITY</name>
              <description>'0': Normal operation (UP: implies RCLK leads NCLK)
'1': Inverted operation (UP: implies NCLK leads RCLK) </description>
              <bitRange>[3:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXED_CUR_EN</name>
              <description>Enable manual override of PFD output
'0': Normal operation
'1': PFD ouput given by FIXED_CUR_SET </description>
              <bitRange>[2:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>FIXED_CUR_SET</name>
              <description>Set the PFD output in a fixed position such that the CP output current is constant'0': UP = 0, DN = 0
'1': UP = 0, DN = 1
'2': UP = 1, DN = 0
'3': UP = 1, DN = 1 </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RADIG_SPARE_REG</name>
          <addressOffset>0x00000870</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000fff8</resetMask>
          <fields>
            <field>
              <name>RADIG_SPARE</name>
              <description>Spare bits to be defined later </description>
              <bitRange>[15:3]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_REF_OSC_REG</name>
          <addressOffset>0x00000202</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002256</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CNT_CLK</name>
              <description>number of clock pulses corresponding to the value of CNT_RO </description>
              <bitRange>[14:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CNT_RO</name>
              <description>number of reference oscillator periods that need to be counted </description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_RSSI_RESULT_REG</name>
          <addressOffset>0x00000902</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RSSI_AVG_RD</name>
              <description>RSSI value measured in averaging mode in continuous RX mode (used for LNA selectivity calibration) </description>
              <bitRange>[15:6]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>RSSI_PH_RD</name>
              <description>RSSI value measured in peak-hold mode during the preamble and Access Addres detection </description>
              <bitRange>[5:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SCAN_FEEDBACK_REG</name>
          <addressOffset>0x00000080</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CP_CUR</name>
              <description>Cp_cur value during scan. </description>
              <bitRange>[7:4]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>LF_RES</name>
              <description>Lf_res value during scan. </description>
              <bitRange>[3:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SPARE1_REG</name>
          <addressOffset>0x00000602</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>RF_SPARE1</name>
              <description>Spare bits for radio </description>
              <bitRange>[15:1]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>IFF_REAL_MODE</name>
              <description>Choose the transfer function mode of the IFF
0: Normal operation (complex)
1: Test mode (real, approx. 16 dB less gain at 1 MHz than in complex mode);</description>
              <bitRange>[0:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_CTRL1_REG</name>
          <addressOffset>0x00000c00</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00002962</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>PLL_HSI_POL</name>
              <description>High Side Injection polarity
0: LO frequency is lower than the wanted RF frequency
1: LO frequency is higher than the wanted RF frequency </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CS</name>
              <description>Channel Spacing
0: 1MHz
1: 2MHz </description>
              <bitRange>[13:13]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SGN</name>
              <description>Sign bit for the channel step
0: positive
1: negative </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CHANNEL_ZERO</name>
              <description>Channel 0 frequency in MHz </description>
              <bitRange>[11:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_CTRL2_REG</name>
          <addressOffset>0x00000c02</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000040b</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>BT_SEL</name>
              <description>0: BT = 0.5; 1: BT = 0.6 </description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>EO_PACKET_DIS</name>
              <description>Disable the end of packet detection

0: End of packet detection enabled
1: End of pakcet detection disabled </description>
              <bitRange>[11:11]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TXDATA_INV</name>
              <description>Select polarity of the modulation prior to the pulse shaping
0: Normal operation
1: Invert the modulation signal </description>
              <bitRange>[10:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAUSS_86</name>
              <description>Select the output resolution in the analog signal path
0: 8 bit resolution for the shaping signal
1: 6 bit resolution for the shaping signal </description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>GAUSS_INV</name>
              <description>Select polarity of the analog modulation path
0: Normal operation
1: Invert the signal in the analog signal path </description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>DELAY</name>
              <description>Additional delay in analog signal path in RCLK cycles </description>
              <bitRange>[7:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODINDEX</name>
              <description>Modulation Index selection
0:h = 1/2 (&#xCE;&#x94;f = 250 kHz)
1: h = 1/4 (&#xCE;&#x94;f = 125 kHz)
2: h = 17/32 (&#xCE;&#x94;f = 266 kHz)
3: h = 35/64 (&#xCE;&#x94;f = 273 kHz) </description>
              <bitRange>[5:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_ORDER_TX</name>
              <description>Order of the sigma-delta modulator in TX mode </description>
              <bitRange>[3:2]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>SD_ORDER_RX</name>
              <description>Order of the sigma-delta modulator in RX mode </description>
              <bitRange>[1:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_CTRL3_REG</name>
          <addressOffset>0x00000c04</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>MODVAL_SEL</name>
              <description>0: Normal operation
1: Use the externally provided value for the modulation </description>
              <bitRange>[14:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MODVAL_WR</name>
              <description>Externally provided modulation value in 2s complement
&#xCE;&#x94;f = 16 MHz x MODVAL_WR/16348 </description>
              <bitRange>[13:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_RESULT2_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000318</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00001480</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>CN_CAL_RD</name>
              <description>Result of the modulation gain calibration (Retained) </description>
              <bitRange>[14:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GAUSS_GAIN_RD</name>
              <description>Modulation gain after trimming (Not Retained) </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_RESULT3_REG</name>
          <addressOffset>0x0000031a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000ffff</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>MDSTATE_RD</name>
              <description>Content of the calibration counter </description>
              <bitRange>[15:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_SYNTH_RESULT_REG</name>
          <description>Must be Retained</description>
          <addressOffset>0x00000316</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000480</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_FREQTRIM_RD</name>
              <description>Result of the VCO calibration (Not Retained) </description>
              <bitRange>[11:8]</bitRange>
              <access>read-only</access>
            </field>
            <field>
              <name>GAUSS_GAIN_CAL_RD</name>
              <description>Result of the modulation gain calibration (Retained) </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
