nguyentri/da-pac/svd/DA14585.svd
        <register>
          <name>RF_TDC_CTRL_REG</name>
          <description>TDC settings</description>
          <addressOffset>0x00000c70</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>TDC_CONNECT</name>
              <description>'0': Normal Operation (no measurement possible)
'1': Connect the PFD inputs also to the TDC inputs
</description>
              <bitRange>[12:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>REF_CTRL</name>
              <description>Select how calibration is performed.
Phase 1:
'0': Count during 1 RCLK period (expect 60-70 as result)
'1': Count during 2 RCLK period (expect 120-140 as result)
'2': Count during 3 RCLK period (expect 180 -210 as result)
'3': not allowed
Phase 2, base the resolution measurement on:
'0': 1 overlap of fast and slow oscillators (NF=NS+1)
'1': 2 overlaps of fast and slow oscillators (NF=NS+2)
'2': 1 overlap of fast and slow oscillators (NF=NS+1)
'3': Not allowed
</description>
              <bitRange>[11:10]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_PH_2</name>
              <description>Select calibration option 2
'0': normal operation (pfd measurement mode or cal mode 1)
'1': measure the slow - fast oscillator period (calibration phase 2)
------- Note CAL_PH_1 must be 0 in this setting
</description>
              <bitRange>[9:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CAL_PH_1</name>
              <description>Select calibration option 1
'0': normal operation (pfd measurement or cal mode 2)
'1': measure the fast oscillator period (calibration phase 1)
------- Note: CAL_PH_2 must be 0 in this setting
</description>
              <bitRange>[8:8]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_SLOW</name>
              <description>Trim the slow oscillator
'0': Minimum frequency (default)
'F': Maximum frequency
</description>
              <bitRange>[7:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>CTRL_FAST</name>
              <description>Trim the fast oscillator
'0': mimimum frequency
'F': maximum frequency

</description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_VCOCAL_CTRL_REG</name>
          <addressOffset>0x00000c06</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000003</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCOCAL_PERIOD</name>
              <description>Length of a VCO calibration step
0: 1 us
1: 2 us
2: 3 us
3: 4 us </description>
              <bitRange>[6:5]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_FREQTRIM_SEL</name>
              <description>0: Normal operation
1: Use VCO_FREQTRIM_WR for the VCO calibration </description>
              <bitRange>[4:4]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>VCO_FREQTRIM_WR</name>
              <description>Externally provided VCO calibration value </description>
              <bitRange>[3:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_VCOVAR_CTRL_REG</name>
          <addressOffset>0x00000c20</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000a492</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>MOD_VAR_V1</name>
              <description>Bias voltage of the VCO Modulation varactor (high Vmod)
0: low
1: mid
2: nominal
3: high </description>
              <bitRange>[15:14]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>MOD_VAR_V0</name>
              <description>Bias voltage of the VCO Modulation varactor (low Vmod)
0: low
1: mid
2: nominal
3: high </description>
              <bitRange>[13:12]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNE_VAR_V3</name>
              <description>Bias voltage of the VCO Tuning varactor (high Vtune)
001: low
010: nominal
100: high
others: not allowed</description>
              <bitRange>[11:9]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNE_VAR_V2</name>
              <description>Bias voltage of the VCO Tuning varactor (high-mid Vtune)
Coding identical to TUNE_VAR_V3 </description>
              <bitRange>[8:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNE_VAR_V1</name>
              <description>Bias voltage of the VCO Tuning varactor (low-mid Vtune)
Coding identical to TUNE_VAR_V3</description>
              <bitRange>[5:3]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>TUNE_VAR_V0</name>
              <description>Bias voltage of the VCO Tuning varactor (low Vtune)
Coding identical to TUNE_VAR_V3</description>
              <bitRange>[2:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_VCO_CALCAP_BIT14_REG</name>
          <description>LUT entry for bit 14 of the VCO calibration capacitance</description>
          <addressOffset>0x00000c22</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x0000559d</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_CALCAP_BIT14</name>
              <description>LUT entry for bit 14 of the VCO calibration capacitance</description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RF_VCO_CALCAP_BIT15_REG</name>
          <description>LUT entry for bit 15 of the VCO calibration capacitance </description>
          <addressOffset>0x00000c24</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>VCO_CALCAP_BIT15</name>
              <description>LUT entry for bit 15 of the VCO calibration capacitance </description>
              <bitRange>[15:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
