nguyentri/da-pac/svd/DA14585.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>wkup580_nl01</name>
      <version>1.0</version>
      <description>wkup580_nl01 registers</description>
      <groupName>Peripheral_Registers</groupName>
      <baseAddress>0x50000100</baseAddress>
      <size>0</size>
      <addressBlock>
        <offset>0</offset>
        <size>26</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>WKUP_COMPARE_REG</name>
          <description>Number of events before wakeup interrupt</description>
          <addressOffset>0x00000002</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>COMPARE</name>
              <description>The number of events that have to be counted before the wakeup interrupt will be given </description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_COUNTER_REG</name>
          <description>Actual number of events of the wakeup counter</description>
          <addressOffset>0x00000006</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>EVENT_VALUE</name>
              <description>This value represents the number of events that have been counted so far. It will be reset by resetting the interrupt. </description>
              <bitRange>[7:0]</bitRange>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_CTRL_REG</name>
          <description>Control register for the wakeup counter</description>
          <addressOffset>0x00000000</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000c0ff</resetMask>
          <fields>
            <field>
              <name>WKUP_ENABLE_IRQ</name>
              <description>0: no interrupt will be enabled
1: if the event counter reaches the value set by WKUP_COMPARE_REG an IRQ will be generated </description>
              <bitRange>[7:7]</bitRange>
              <enumeratedValues>
              <name>ENUM</name>
              </enumeratedValues>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP_SFT_KEYHIT</name>
              <description>0: no effect
1: emulate key hit. The event counter will increment by 1 (after debouncing if enabled). First make this bit 0 before any new key hit can be sensed. </description>
              <bitRange>[6:6]</bitRange>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUP_DEB_VALUE</name>
              <description>Keyboard debounce time (N*1 ms with N = 1 to 63).
0x0: no debouncing
0x1 to 0x3F: 1 ms to 63 ms debounce time</description>
              <bitRange>[5:0]</bitRange>
              <enumeratedValues>
              <name>ENUM</name>
              </enumeratedValues>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_POL_P0_REG</name>
          <description>Select the sensitivity polarity for each P0 input</description>
          <addressOffset>0x00000012</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>WKUP_POL_P0</name>
              <description>0: enabled input P0x will increment the event counter if that input goes high
1: enabled input P0x will increment the event counter if that input goes low</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_POL_P1_REG</name>
          <description>Select the sensitivity polarity for each P1 input</description>
          <addressOffset>0x00000014</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003f</resetMask>
          <fields>
            <field>
              <name>WKUP_POL_P1</name>
              <description>0: enabled input P1x will increment the event counter if that input goes high
1: enabled input P1x will increment the event counter if that input goes low</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_POL_P2_REG</name>
          <description>Select the sensitivity polarity for each P2 input</description>
          <addressOffset>0x00000016</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003ff</resetMask>
          <fields>
            <field>
              <name>WKUP_POL_P2</name>
              <description>0: enabled input P2x will increment the event counter if that input goes high
1: enabled input P2x will increment the event counter if that input goes low</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_POL_P3_REG</name>
          <description>Select the sensitivity polarity for each P3 input</description>
          <addressOffset>0x00000018</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>WKUP_POL_P3</name>
              <description>0: enabled input P3x will increment the event counter if that input goes high
1: enabled input P3x will increment the event counter if that input goes low</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_RESET_CNTR_REG</name>
          <description>Reset the event counter</description>
          <addressOffset>0x00000008</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>WKUP_CNTR_RST</name>
              <description>writing any value to this register will reset the event counter</description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_RESET_IRQ_REG</name>
          <description>Reset wakeup interrupt</description>
          <addressOffset>0x00000004</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000ffff</resetMask>
          <fields>
            <field>
              <name>WKUP_IRQ_RST</name>
              <description>writing any value to this register will reset the interrupt. reading always returns 0. </description>
              <bitRange>[15:0]</bitRange>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_SELECT_P0_REG</name>
          <description>Select which inputs from P0 port can trigger wkup counter</description>
          <addressOffset>0x0000000a</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>WKUP_SELECT_P0</name>
              <description>0: input P0x is not enabled for wakeup event counter
1: input P0x is enabled for wakeup event counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_SELECT_P1_REG</name>
          <description>Select which inputs from P1 port can trigger wkup counter</description>
          <addressOffset>0x0000000c</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x0000003f</resetMask>
          <fields>
            <field>
              <name>WKUP_SELECT_P1</name>
              <description>0: input P1x is not enabled for wakeup event counter
1: input P1x is enabled for wakeup event counter</description>
              <bitRange>[5:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_SELECT_P2_REG</name>
          <description>Select which inputs from P2 port can trigger wkup counter</description>
          <addressOffset>0x0000000e</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000003ff</resetMask>
          <fields>
            <field>
              <name>WKUP_SELECT_P2</name>
              <description>0: input P2x is not enabled for wakeup event counter
1: input P2x is enabled for wakeup event counter</description>
              <bitRange>[9:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUP_SELECT_P3_REG</name>
          <description>Select which inputs from P3 port can trigger wkup counter</description>
          <addressOffset>0x00000010</addressOffset>
          <size>16</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000ff</resetMask>
          <fields>
            <field>
              <name>WKUP_SELECT_P3</name>
              <description>0: input P3x is not enabled for wakeup event counter
1: input P3x is enabled for wakeup event counter</description>
              <bitRange>[7:0]</bitRange>
              <access>read-write</access>
            </field>
          </fields>
        </register>
